{"Abstract": "Work engagement has a contribution to the success of an organization. Governmental institutions are often criticized for showing less satisfying performance and less effective services due to the misconducts of the civil servants such as coming late to work, leaving at working hours, and being less enthusiastic at work. This study aimed to examine civil servants' working conditions using three variables, namely leader-member exchange, psychological well-being, and work engagement. The measuring tools used referred to the Leader-Member Exchange Multidimensional (Liden &amp; Maslyn, 1998), Psychological Well-being Scale (Ryff, 1989) and Utrecht Work Engagement Scale (Schaufeli &amp; Bakker, 2004). There were 80 civil servants involved in this study as the subjects. They were selected using simple random sampling technique. Statistical techniques used in this study Structural Equation Modeling-Partial Least Square (SEM-PLS) with Warp PLS 5.0 Software. The result indicated that the three variables had a positive correlation with one another, and psychological well-being mediated the influence of leader-member exchange on work engagement.", "Citation Title": "Leader-member exchange affects work engagement: The role of psychological well-being mediation", "DOI": "10.21580/pjpp.v4i1.3360"}
{"Abstract": "Housewives with HIV/AIDS are faced with internal problems because the virus continues to invade their bodies and external problems such as caring for their husbands and children infected with HIV/AIDS, stigma and discrimination, maintaining family integrity and even taking responsibility for economic problems when the husband dies. They need social support. One of the most important sources of social support is peers, especially for those who have not done open status to the family. Peer support can be obtained through Peer Support Groups (KDS) through counseling, education, and information. This qualitative research using the methodo­logy approach tries to explore the social support that is obtained by housewives with HIV/AIDS through peer support groups that they participate in General Hospital Dr. Kariadi Semarang. Research involving 15 informants shows that peer support groups can provide social support for them, including information support about the treatment and development of HIV/AIDS; emotional support, self-esteem support, and network support such as intensive communication and strong friendships; and real assistance: venture capital assistance, business skills, and assistance in accessing treatment", "Citation Title": "A social support for housewives with HIV/AIDS through a peer support group", "DOI": "10.21580/pjpp.v4i1.3378"}
{"Abstract": "Successful interpersonal communication is one of the determinants of success factors of preaching, counseling, and learning. However, the data showed that not all students can deliver effective interpersonal communication. It can be developed if students have self-concept and self-efficacy. This study aims to examine the effects of self-concept and self-efficacy on students' interpersonal communication. The subjects of this study were 342 students of the Walisongo State Islamic University of Semarang, who were selected using the cluster random sampling technique. Data were collected using three psychological scales, namely self-concept scale, self-efficacy, and effective interpersonal communication scale. Simple regression techniques and multiple regressions were used for analyzing the data. The results of the study showed that self-concept partially influenced the effectiveness of the students' interpersonal communication, contributing by 12.7%. In line with the finding, self-efficacy also has a contribution to it by 12%. Also, self-concept and self-efficacy simultaneously had contributions to the effectiveness of the students' interpersonal communication as much as 12.2%.", "Citation Title": "Self concept, self efficacy, and interpersonal communication effectiveness of student", "DOI": "10.21580/pjpp.v4i1.3196"}
{"Abstract": "Interaction among children with their parents and peers has an important role in developing aggression in adolescents. Negative interaction can form children’s negative perception of attachment to their parents and peers. In turn, it facilitates adolescent’s negative schemes from childhood to adolescence. Negative scheme children are generally easy to get anxious, difficult to trust another person in interaction, and aggressive. This study aimed to examine the perceptions of attachment effect to their father, mother, and peer on male adolescents' aggressive behaviors. The subjects of this study were 31 adolescents aged 12-15 years old, who lived in PSMP Antasena in Magelang. They were selected through purposive sampling technique. The data were collected using aggressive behavior scale and modification of parents and peer attachment inventory. The method used for analyzing data was multiple regression. The results of the analysis showed that R=0.688, p&lt;0.01, indicating that the perceptions of father, mother and peer attachment significantly can predict aggression in male adolescents.", "Citation Title": "The perception of attachment effect in parents and peers on aggressive behavior in male adolescents", "DOI": "10.21580/pjpp.v4i1.3118"}
{"Abstract": "This study aimed to examine parenting self-efficacy especially in mothers who have children with autism spectrum disorder and who suffer from parenting stress. They showed symptoms of anxiety and depression, which indicated parenting stress. Parenting self-efficacy is predicted to be a factor that can decrease anxiety and depression. There were 45 mothers from the city of Surabaya selected through purposive sampling technique to be the participants of this study. The data were collected through a survey using questionnaires concerning Self-efficacy for Parenting Task Index (SEPTI) and Parenting Stress Index Short Form (PSI-SF). The data analyzed using the statistical parametric of the Pearson product-moment correlation coefficient showed that the correlation coefficient was -0.424 and the significance was 0.004. It was concluded that high parenting self-efficacy of mothers who have children with autism spectrum disorder correlates with parenting stress.", "Citation Title": "Self-efficacy parenting and nursing stress: Study on mother from spectrum autism children", "DOI": "10.21580/pjpp.v4i1.3298"}
{"Abstract": "Teachers are important figures in forming the school climate, including in inclusive schools. Their perception will influence the learning process and indirectly affect students’ achievements. This study aimed to identify teachers’ perceptions of school climate in inclusive schools. Mixed method was used in this study. Quantitatively, questionnaires were given to 127 teachers from 2 inclusive vocational schools and 4 inclusive high schools in Jakarta, Bandung, and Surakarta, using accidental sampling technique. In each class, there were 2 – 3 students with special needs, which encompassed different types of disability such as physically disabled, low vision, slow learner, Attention Deficit Hyperactivity Disorder (ADHD) and autism. Qualitatively, school observations and interviews were conducted with 10 teachers. The results showed that their perceptions of the school climate in high schools and vocational schools tended to be positive although the knowledge and application of inclusive education still needed to be improved. There were differences in several perceptual aspects due to the duration of teaching and the type of school.", "Citation Title": "Teachers' perceptions of school climate in inclusive schools", "DOI": "10.21580/pjpp.v4i1.3357"}
{"Abstract": "Chronic Kidney Disease (CKD) not only affects the physical condition but also impacts on psychological conditions, such as feeling down, embarrassed by appearance, feelings of worthlessness, anxiety, to despair which is the cause of decreased quality of life. In improving the quality of life requires a psychological intervention called Mindfulness-Based Cognitive Therapy (MBCT). This study aims to seek the effects of MBCT interventions on improving the quality of life of patients with Chronic Kidney Disease (CKD) with hemodialysis. Research participants were 3 people. This research was a case study research with a mixed method. Data analysis strategy used was a concurrent embedded strategy that compares quantitative and qualitative data. The result showed that MBCT interventions could improve participant’s quality of life. MBCT interventions provide the skills to be aware of clear thoughts, feelings, and events without assessing them so that patients can sort out the things that originate from their thoughts and distinguish them from actual events. This accomplishment of the result can be perceived from the arising of feeling more enjoy life and there is an increase in scores on each aspect of quality of life on the measurement scale used.", "Citation Title": "Mindfulness-Based Cognitive Therapy (MBCT) in  improving quality of life: Case study in Chronic Kidney Disease patients with hemodialysis", "DOI": "10.21580/pjpp.v4i1.3332"}
{"Abstract": "The intention of employees to leave the organization, or known as turnover intention, is something that must be taken seriously by an organization as it may affect the sustainability of the organization. This study aimed to determine the effect of resilience as a mediator in the relationship between future time perspective (FTP) and turnover intention. Data were taken using convenience sampling from various state-owned enterprises (Badan Usaha Milik Negara, BUMN) in Depok and Jakarta area (N = 310). The study used a self-rating method using 3 measurements, namely Zimbardo Time Perspective Inventory, Brief Resilience Scale, and Turnover Intention. Data were analyzed using mediation technique by Hayes’ PROCESS macro on SPSS program. The results showed that FTP negatively and significantly affected turnover intention and that resilience fully mediated the relationship. As a practical implication, this study provides information for organizations to employ programs to increase employees’ future time perspective and resilience.", "Citation Title": "Future time perspective and turnover intention: The mediating role of resilience", "DOI": "10.21580/pjpp.v4i1.3120"}
{"Abstract": "Happiness is something that every individual yearns for, so an understanding of the factors that influence it is needed. This study aims to test the influence model of social support, spirituality, and gratitude on happiness through self-acceptance. Data collection using the scale of social support, spirituality, gratitude, self-acceptance, and happiness, with a sample of 790 Indonesian students. The data were analyzed using Structural Equation Modeling (SEM) analysis. The structural model showed acceptable goodness of fit. Self-acceptance was demonstrated to significantly serve as a mediating variable in social support, spirituality, and gratitude in relation to happiness. In addition, social support (β = .112, p &lt; .01), gratitude (β = .256, p &lt; .01), spirituality (β = .431, p &lt; .01), and self-acceptance (β = .364, p &lt; .01) had significant positive relationships with happiness. The study has important implications globally for characteristics such as the sample used, especially with regard to the self-acceptance and happiness of university students.", "Citation Title": "Examining social support, spirituality, gratitude, and  their associations with happiness through self-acceptance", "DOI": "10.21580/pjpp.v7i2.13371"}
{"Abstract": "Women and children in many countries are forced to migrate due to prolonged civil wars and conflicts. The factors and conditions that affect the well-being of immigrant and refugee populations residing in host countries are not widely known. This study aims to identify and explore the personal experiences and migration processes that affect the well-being of immigrant women in Indonesia. A qualitative method and case study design were implemented. Eight refugee women from three different countries were interviewed: Somalia, Palestine, and Afghanistan. It was found that the contexts of identification, personal experiences, the migration process, and the motives or triggers for migration were important factors in influencing the women’s present and future well-being. The study provides implications for the theory of the model used. The application of the theory assisted the researchers to construct a conceptual framework of the subjective well-being of immigrant women.", "Citation Title": "Migration process experience and its impact on well-being among women immigrants in Indonesia", "DOI": "10.21580/pjpp.v7i2.12596"}
{"Abstract": "The Brief Coping Orientation to Problem Experienced (COPE) scale is widely used for measuring coping strategies. However, concerns persist regarding the dimensions captured by the scale and the accuracy of item representation. This study examined the relevance of adapted Brief COPE items using discriminant content validity (DCV). A panel of experts (n = 15) assessed the extent to which the items corresponded to their intended dimensions. Intraclass correlation (ICC) estimates ranged from 0.640 to 0.828, indicating agreement among experts. A one-sample t-test evaluated DCV, revealing that 21 out of 28 items distinctly and exclusively measured intended dimensions, confirming their discriminant content validity. Seven items were excluded: three did not measure coping strategies (non-dimension), and four measured them in different dimensions (wrong-dimension). The discriminant content-validated Brief COPE scale improves coping assessment, benefiting psychological therapies and providing researchers with refined measures for each coping strategy dimension, addressing dimensional concerns.", "Citation Title": "Exploring the usefulness of the Brief COPE in clinical and positive psychology: A discriminant content validity study", "DOI": "10.21580/pjpp.v8i1.15063"}
{"Abstract": "Performance pressure and caffeine consumption, a common combination in daily life, have both been shown to affect cognitive performance. However, previous research has not fully elucidated the extent to which the effects of caffeine and performance pressure impact cognitive function, especially working memory. This study aims to examine the possibility that caffeine can enhance working memory performance under pressure. A total of 61 participants aged 18 to 32 participated, divided into four groups. Experiment-based data collection was conducted with a single-blind design. Working memory was measured by Modular Arithmetic Tasks with the OpenSesame program. All participants were asked to perform arithmetic tasks and arousal levels were measured using the Galvanic Skin Response (GSR). The findings revealed no evidence of an interaction effect of caffeine intake and performance pressure on working memory (F= .632, p= .431,   h   p    2    = .012). Given the prevalence of caffeine intake prior to facing high-pressure situations, the consumption of a cup of coffee does not improve cognitive performance as many would expect. However, caffeine intake had a stabilizing effect on the skin conductance response values during performance under pressure. Clinical psychologists can use a daily dose of caffeine as an alternative intervention or preventative measure to help patients reduce performance pressure-related anxiety.", "Citation Title": "Effects of caffeine intake and performance pressure on working memory", "DOI": "10.21580/pjpp.v8i1.15557"}
{"Abstract": "The creation of good relations between family members during the COVID-19 pandemic is considered important to accommodate the learning needs of autistic children as during the pandemic, they are not able to learn optimally. This study aims to establish the role of family counseling in handling autistic children during at-home learning. The research uses a qualitative case study design. The informants were parents and core families of autistic children, and data collection involved interviews, observations, and documentation. The data analysis techniques employed were inductive analysis through reduction, data description, data coding, interpretation, and conclusions. The results show that the involvement of family members took place on a scheduled basis, relations between them improve, and making independent. The passion for building self-potential by developing a sense of respect for family members who help with autistic children's activities when learning from home. Family counseling through the involvement of family members can have a positive effect on the behavioral development of autistic children and a beneficial impact on other family members. The implication is that family counseling can be applied to help the social-emotional development of autistic children.", "Citation Title": "The role of family counseling in handling autistic children during at-home learning periods", "DOI": "10.21580/pjpp.v7i1.10960"}
{"Abstract": "Rheumatoid arthritis is a chronic autoimmune illness rarely found in Indonesia. The sufferers mostly are women. This illness affects both the physical and psychological conditions of the sufferers. The symptoms appear almost every day and can cause permanent disability, and even death. It disrupts the quality of life and daily activities of the sufferers, as well as decreases their self-reliance in trying to curing the illness. The provision of cognitive-behavioral therapy is expected to increase their quality of life and self-efficacy. The method used in this study was a single case experiment with a single-subject A-B design. Visual analysis was used to analyze the data. The results showed that the quality of life and self-efficacy of the three subjects increased with the effect size score of 0.8. The women with rheumatoid arthritis had improved knowledge about their illness, decreases in pain, fatigue, and relapses; increased ability to manage the symptoms of the illness; and confidence that they could do their daily activities better.", "Citation Title": "Can cognitive behavioral-therapy increase the quality of life and self-efficacy in rheumatoid arthritis patients?", "DOI": "10.21580/pjpp.v4i2.4184"}
{"Abstract": "The number of work accidents in production employees is high. One reason is the lack of compliance of employees with workplace safety rules. The necessary aspects that can improve workplace safety are safety climate and safety motivation. The purpose of this study was to examine the effect of safety climate on safety behavior both directly and indirectly mediated by safety motivation. Three scales were used in this study, namely the safety behavior scale, the safety climate scale, and the safety motivation scale. The Cronbach’s Alpha coefficients were 0.898, 0.922, and 0.896. The respondents were 78 employees in the production, processing, and quality assurance section. Data were analyzed using regression analysis. The result showed the direct effect (β = 0.272) and the indirect effect of safety climate on safety behavior (β = 0.281). The effect of climate safety on safety behavior was partially mediated by safety motivation.", "Citation Title": "Effect of safety climate on safety behavior in employees: The mediation of safety motivation", "DOI": "10.21580/pjpp.v4i2.3346"}
{"Abstract": "Self-compassion is a trait that helps people to withstand stressful situations. Self-compassion helps people to maintain self-regulation, to interpret the positive side of the problems, and to avoid ego depletion. The purpose of this research is to examine the indirect effect of self-compassion to ego depletion with forgiveness as a mediating variable. Forgiveness selected as a mediating variable because of its ability to play a role as a coping strategy and reduce ego depletion tendency. The researcher believes that the impact of self-compassion to ego depletion increasing if forgiveness included as a mediating variable. This research used a regression technique analysis. Data were collected on 200 students by purposive sampling technique using a self-compassion scale, ego depletion scale, and forgiveness scale. The result shows that the impact of self-compassion to ego depletion decreased without forgiveness as a mediating variable. The researcher concluded that forgiveness was effective as a mediating variable to self-compassion and ego depletion.", "Citation Title": "Forgiveness as a mediator on the effect of self-compassion on the ego depletion", "DOI": "10.21580/pjpp.v4i2.3814"}
{"Abstract": "Abstract: Quality of Work-life (QWL) in an employee is an important aspect to which a company needs to pay much attention, moreover if the employee experiences a job-skill mismatch. This study aimed to test the effect of job involvement and perceived happiness simultaneously and partially on the quality of work-life in an employee who experiences a job-skill mismatch. The instruments used for collecting data were the QWL scale, job involvement scale, and perceived happiness scale. The subjects of this study were 64 employees. The method of data analysis was the multiple regression analysis. The result of this study showed that job involvement and perceived happiness simultaneously affected QWL (r=0,763; p=0,000). Partially job involvement also had an effect on QWL (r=0.64; p=0,000) and perceived happiness on QWL (r=0,261; p=0,039). Simultaneously, the contribution of job involvement and perceived happiness to the QWL of the employees with a job-skill mismatch was 56.9%. It means that the higher the rate of job involvement and perceived happiness, the higher the quality of work-life an employee with a job-skill mismatch has, and vice versa.", "Citation Title": "Quality of work-life in employees experiencing a job-skill mismatch", "DOI": "10.21580/pjpp.v4i2.2734"}
{"Abstract": "When faced with a particular ethical dilemma, individuals are expected to make ethical decisions through an ethical decision-making process (EDM). Today’s employees provide added value to organizations that implement flexible arrangements to support employee’s well being and work-life balance. This research was conducted through an online survey on 236 active employees with a minimum age of 22 years old in Indonesia. Likert scales were used to examine the effect of flexible work arrangements (FWA) mediated by work-life balance (WLB) on the level of EDM of individuals in organizations. The mediation results showed that FWA mediated by WLB significantly predicted an increase in individual’s EDM level (b = .359, SE = .116, 95% CI = .152 - .607). Positive implementation of FWA leads to balanced WLB which in turn increased the level of individual EDM.", "Citation Title": "Increasing ethical decision making through flexible work arrangement", "DOI": "10.21580/pjpp.v4i2.3043"}
{"Abstract": "Happiness is a concept that is difficult to understand to this date. Differences in individual perspectives in interpreting happiness also affect the processing construct of the measurement. This study aims to conduct convergent validation of the existing happiness scale. Convergent validation can test how good the happiness scale is by comparing the externally to another scale that is considered to have a relationship. The happiness convergent-scale validation adapted the Multi-trait Multi-method (MTMM) analysis. Respondents involved in this study were 186 students from traditional Muslim schools or Santri who were selected according to the specified characteristics and studied at UIN Sunan Gunung Djati Bandung. The three measuring instruments used are the Oxford Happiness Questionnaire (OHQ), the Indigenous Happiness Scale (IHS), and the World Health Organization Quality of Life-Bref (WHOQOL-Bref). The correlation coefficient (r) shows values of 0.52 (OHQ-IHS), 0.53 (OHQ-WHOQOL-Bref), and 0.45 (IHS-WHOQOL-Bref). The result indicated that the correlation of the three scales tested has a statistically high relationship so that the three measuring instruments used have convergent validity and can be used to measure the construct of happiness.", "Citation Title": "Validation of happiness scale convergence in santri through Multi-trait Multi-method Analysis", "DOI": "10.21580/pjpp.v4i2.3670"}
{"Abstract": "Social justice warrior (SJW) is a pejorative term for individuals who fight for equality, environment, and gender. Because their progressive morals radically differ from the predominant values, the so-called social justice warriors spark controversies. This study aimed to describe netizens’ opinions about SJW and describe the dynamics of conflict or support in more detail. Text mining and opinion coding were used to elicit research data. The opinions that we gathered were analyzed in 2 stages: sentiment analysis and content analysis. The results of sentiment analysis are negative (445), neutral (86), and positive (90). Content analysis of the negative opinions showed the characteristics of sarcastic, rude, critical, and contemptuous (mocking/disrespecting). The style of positive sentiments (comments congruent with the phenomena) is divided into supportive, empathic, and motivational opinions. Negative opinions are more dominant because of netizens’ self-acceptance, the effects of informal social control in cyberspace, SJW’s presumed social non-compliance, and doubts of objectivity. Positive opinions can be explained by criticism of social contract theory, namely the demand to be more supportive of minority groups, sensitivity, and empathy (the ability to feel other groups' social conditions and environmental conditions).", "Citation Title": "Progressive view on social justice: Netizen opinions about social justice warrior", "DOI": "10.21580/pjpp.v5i1.5250"}
{"Abstract": "Making a resilient caregiver is important; in addition to lack of preparation, they are not adequately supported. Psychoeducational support groups can provide the necessary education about the conditions they are about to confront and create the sources of social support that will enable and fortify them when dealing with difficult conditions. This research aimed to understand the effect of a psychoeducational support group on caregivers' resilience of chronic kidney disease patients undergoing hemo­dialysis. Five subjects were used in this case study, which employed mixed methods using a concurrent embedded strategy that used primary quantitative data. The qualitative data analysis used thematic analysis, while the quantitative data analysis used Wilcox signed ranks test. Quantitative data analysis showed a p-value of .892, which led the researcher to conclude no differences between the pre and post resilience scores. Qualitative primary data analysis revealed that psychoeducational support group has a positive effect on caregivers’ resilience. Besides, this research discovered that a psychoeducational support group can significantly increase the per­ception of caring ability and ameliorate the difficulties in taking care of patients.", "Citation Title": "Psychoeducational support group to the resilience of caregivers of chronic kidney disease patients undergoing hemodialysis", "DOI": "10.21580/pjpp.v5i1.3572"}
{"Abstract": "Building resilience in adolescents is an important need, especially for those who spend most of their time at home with their families while facing the pandemic situation. Resilience enables adolescents to survive, adapt, and rise up when faced with difficult circumstances. This study aims to empirically examine the role of secure attachment and mindfulness in adolescent resilience in the new normal era. The study subjects were 220 junior high school students in Semarang City, Indonesia, who were selected using the convenience sampling technique. The study is based on correlational quantitative research using regression analysis. The instruments used were the Secure Attachment Scale, Mindfulness Scale, and Resilience Scale. The results show that there was a significant and positive relationship between secure attachment and mindfulness, and adolescent resilience in the new normal era (R 2  = .56, F = 16169, p &lt; .01). The findings provide useful suggestions for families to emphasize the development of psychological skills, especially resilience in adolescents, throughout the country.", "Citation Title": "How do they deal with the Pandemic? The effect of secure attachment and mindfulness on adolescent resilience", "DOI": "10.21580/pjpp.v6i1.6857"}
{"Abstract": "Psychological assistance is crucial in recovering the psychological condition of children in conflict with the law. The City Government of Semarang, Indonesia has responded to this need with a school-based restorative justice program. This study aims to explore the factors that can hinder the psychological recovery process of children in conflict with the law during the implementation of the program. A qualitative approach was employed, based on case studies of three children in conflict with the law, with their significant others as participants. Case study data analysis techniques were employed, namely matching patterns, building explanations, finding model logic, and synthesizing cases. The results show that negative peer support, drug abuse, negative role models, emotional detachment, and negative stigma towards children in conflict with the law can be factors that hinder their psychological recovery process. The findings could provide the basis for practitioners in the preparation of psychological interventions that are relevant to the psychological recovery needs of children.", "Citation Title": "Factors inhibiting the psychological recovery process of children in conflict with the law", "DOI": "10.21580/pjpp.v6i1.6578"}
{"Abstract": "The participation of women in the workforce creates challenges and problems. Those with various roles in their lives must be good at playing and balancing these successfully. This study focuses on the work-life balance factor by exploring the predictor factors including personality, family social support, and childcare responsibilities, as moderated by gender role attitude. A work/ nonwork interference and enhancement scale, mini-IPIP, gender role beliefs scale, and social support scale were developed for the data collection. A sample of 220 married female workers was identified using purposive sampling. The data analysis, which used multiple regression and a modgraph, shows a significant effect of personality, social support, and childcare responsibilities on the work-life balance moderated by gender role attitude. Four independent variables with significant influence are neuroticism, openness to experiencing family support, gender role attitude and there is a moderating effect on neuroticism and family support. The implication is the need to provide a comfortable work environment and arrangement of work patterns so that women's work-life balance can be achieved positively.", "Citation Title": "Examining gender role attitude as a moderator of personality, social support, and childcare responsibilities  in women’s work-life balance", "DOI": "10.21580/pjpp.v6i2.9591"}
{"Abstract": "Many individuals with coronary heart disease (CHD) have erroneous beliefs about the condition, which in turn increases anxiety and depression. Providing information and facts about CHD through video may be able to correct the wrong conceptions of individuals about their disease. A total of 150 individuals with CHD at Hasan Sadikin Hospital, Bandung, Indonesia (male = 65%, female = 35%) were divided into a control group and two experimental groups, with a quasi-experimental before-after design. The participants completed the York Cardiac Beliefs questionnaire at the start of the measurement, immediately after watching the video (time 1), and again after watching the video six times over a two week period (time 2). Beck Anxiety Inventory and Beck Depression Inventory-II questionnaires were also completed by participants at the beginning of the experiment and at time 2. The repeated measures ANOVA analysis showed a significant decrease in both experimental groups in terms of wrong beliefs about CHD (t=8.68 &amp; 8.69, p&lt; .01), anxiety (p&lt; .01), and depression (t=8.17 &amp; 7.76, p&lt; .01). Watching videos giving facts and information about CHD can therefore correct erroneous beliefs about CHD, and reduce levels of anxiety and depression in individuals suffering from the disease.", "Citation Title": "Changing maladaptive beliefs among individuals with coronary heart disease using video information", "DOI": "10.21580/pjpp.v6i2.9406"}
{"Abstract": "Impulsivity increases the risk of addiction and negatively affects academic performance. One-way high school students can manage impulsivity is through mindfulness skills, in which the relationship between mindfulness and impulsivity can be mediated by emotion regulation. This study aims to establish whether emotion regulation plays a mediating role in the relationship between mindfulness and impulsivity in high school students. Quantitative research was conducted through mediation analysis using Hayes' PROCESS program. The Mindfulness Attention Awareness Scale (MAAS) was used to measure mindfulness; impulsivity was measured using the Barratt Impulsiveness Scale 11 (BIS-11); and emotional dysregulation using the Difficulties in Emotion Regulation Scale (DERS). The participants were 390 high school students in Indonesia aged 15-18. The results show that emotion regulation partially mediated the relationship between mindfulness and impulsivity (ab = -.11, SE = 0.02, 95% CI [-0.16, -0.07]). Mindfulness was found to improve emotion regulation skills and reduce impulsivity in high school students. The implications of the study are important in helping adolescents manage impulsivity, as they are at an age that is prone to risk taking. The use of mindfulness in schools could help manage emotional and behavioral problems in adolescents at high school age.", "Citation Title": "The mediating effect of emotion regulation on the mindfulness and impulsivity of high school students", "DOI": "10.21580/pjpp.v6i2.8953"}
{"Abstract": "The threat of sexual violence can occur anywhere, including in the family environment. The subject of this study was a fifteen-year-old girl with a diagnosis of post-traumatic stress disorder who had been a victim of incest by her stepfather. The study aims to examine the effectiveness of trauma-focused cognitive behavioral therapy to reduce symptoms of post-traumatic stress disorder. It uses a Single Case-Single Subject ABA design. The intervention involved 12 sessions of trauma-focused cognitive-behavioral therapy. Symptoms of posttraumatic stress disorder were measured by the Child Posttraumatic Stress Disorder Symptom Scale (CPSS). There was a change in the CPSS scores in the intervention and post-intervention processes, with the post-traumatic stress disorder scores changing from the moderate to the mild category of post-traumatic stress disorder. The decrease in the scores was also evidenced by the results of the different pre-intervention, intervention, and post-intervention CPSS scores using Mann-Whitney nonparametric analysis. The study has implications for the application of trauma-focused cognitive-behavioral therapy to reduce symptoms of post-traumatic stress disorder in adolescent girls who are victims of incest.", "Citation Title": "Trauma-Focused Cognitive Behavioral Therapy to reduce symptoms of post-traumatic stress disorder in adolescent victims of incest", "DOI": "10.21580/pjpp.v6i2.8242"}
{"Abstract": "Substance Use Disorder (SUD) is a social phenomenon that has plagued communities, including adolescents. Coping strategy and drug hazard knowledge are seen as important factors in curbing drug use amongst young people. This study aims to identify the indirect influence of coping strategy through drug hazard knowledge as a mediator in substance use disorders. The research employed a quantitative approach with a cross-sectional design, with a sample of 381 adolescents, 313 males and 68 females, selected using a simple random sampling technique. The research instruments comprised the Drugs Abuse Screening Test-28, a coping scale, and drug hazard knowledge scale. AMOS 20.0 for Structural Equation Modelling (SEM) was used for the analysis. The results show no significant indirect influence of coping strategy through drug hazard knowledge as a mediator in substance use disorder among adolescents. This indicates that drug hazard knowledge has no significant influence on substance use disorders.", "Citation Title": "Coping strategy and substance use disorders: The mediating role of drug hazard knowledge", "DOI": "10.21580/pjpp.v6i2.8185"}
{"Abstract": "COVID-19 affects human life, but very few studies have examined the quality of life of children and adolescents during the pandemic. This article aims to report on the quality of life of children and adolescents (N = 1,474; ages 10-18 years) during the COVID-19 pandemic in Indonesia. Data were collected using Google Forms and convenience sampling. The measuring instrument used measured five domains of quality of life, namely material, physical, social, emotional, and productive well-being. The data were analyzed using crosstab, frequency, comparison of mean values, and ANOVA. The results show that children and adolescents have been able to maintain their subjective well-being and adapt to unpleasant situations during the lockdown. Younger boys and girls show significantly higher mean scores than older ones. Children and adolescents reported that they were bored because they had limited physical activities, were dissatisfied with school closures and with what they had learnt at home, and were frustrated by the limited contact they had with friends. The research has implications in providing advice to parents, teachers, children, and adolescents to improve the quality of life of children and adolescents during the pandemic.", "Citation Title": "Children’s and adolescents’ reports on their quality of life during the COVID-19 pandemic", "DOI": "10.21580/pjpp.v6i2.8572"}
{"Abstract": "Mindful parenting intervention programs and characteristics can support positive parenting conditions and have an impact on children's psychosocial development. However, the measurement of mindful parenting has not been widely developed, although one example is the Mindfulness in Parenting Questionnaire (MIPQ) scale, which has good psychological properties and has been validated in several countries. This study aims to obtain evidence of the validity of the interpretation of the Indonesian version of the MIPQ scale (MIPQ-Ind) amongst a population of parents with children aged 2 -12. The participants were 822 parents (268 fathers and 554 mothers) who live in Jakarta, Indonesia. The results, based on the use of the split sample technique and EFA and CFA tests, show that the MIPQ-Ind has two valid factors, as indicated by the index 2/df= 2.8, CFI = 0.9, GFI = 0.96, RMSEA = 0.06 and RMSR = 0.04. The internal structure validity is 0.913 for the ‘being in the moment with child’ (BMC) factor and 0.906 for the mindful discipline (MD) factor. The study shows that the MIPQ-Ind was able to measure mindful parenting in the population of parents with children aged 2-12 in Indonesia.", "Citation Title": "Adaptation of Mindfulness in Parenting Questionnaire (MIPQ) for parents of children aged 2-12 years", "DOI": "10.21580/pjpp.v6i2.7952"}
{"Abstract": "Many studies have found that a low socioeconomic status has a negative impact on welfare. However, contextual evidence on this issue in Malaysia is scarce. Therefore, this study attempts to quantitatively examine the effect of socioeconomic status on life and job satisfaction among low-income employees working in the public. The Satisfaction with Life Scale (SWLS), Work Domain Satisfaction Scale (WDSS), and Socioeconomic Questionnaire were presented to 265 respondents chosen using a convenience sampling technique. The data were then analyzed using SPSS 26.0 and SmartPLS 3.0 equation modeling. The results show that socioeconomic status had a positive effect on life satisfaction (t = 4.581; p &lt; .001) and job satisfaction (t = 3.423; p &lt; .001). Thus, this study contributes to the provision of better insights into the socioeconomic status factors that determine life and job satisfaction, especially among low-income employees working in the public sector in Malaysia.", "Citation Title": "The influence of socioeconomic status on job  and life satisfaction among low-income employees  in Johor Local Authorities", "DOI": "10.21580/pjpp.v6i2.8304"}
{"Abstract": "Hope plays an important role in individuals’ attempts to overcome various problems in a positive way and with positive results. This study aims to examine the effect of parent-child attachment on the existence of hope. The research method involved a quantitative approach. The accidental sampling technique was used to determine the sample and identified 400 adolescents consisting of junior and senior high school students aged 12-19 in Yogyakarta, Indonesia. Parent-child attachment was measured using the Parental Bonding Instrument, while expectation was measured using Snyder's Hope Scale. The data were analyzed using linear regression to predict the relationship between parent and child attachment and expectations. The results show that warm and loving care from the father (B = 0.37, p &lt; .001] and the mother (B = 0.47, p &lt; .001], as well as the provision of autonomy by the father (B = 0.52, p &lt; .001] and mother (B = 0.38, p &lt;.01] proved to be predictors of adolescent expectations, while over-protection from the father (B = 0.03, p&gt; .05]) and the mother (B = -0.18, p&gt; .05) were not predictors of the existence of hope. The implications of the research results could serve as a reference for the parenting practice and guidance to adolescents both in the contexts of family and school education.", "Citation Title": "Parental bonding as a predictor of hope in adolescents", "DOI": "10.21580/pjpp.v6i1.7981"}
{"Abstract": "Measuring instruments that have satisfactory psychometric properties are needed to improve mental health research and services, especially in the effort to measure, identify, and monitor psychological problems experienced by individuals. The purpose of this study is to examine the psychometric properties of the Indonesian version of the Depression Anxiety Stress Scale (DASS). The study involved 1922 participants aged 16-26 in Surabaya, Indonesia. Data collection was made using the convenience sampling method. Testing of the factor structure, reliability, and measurement invariance of the Indonesian version of the DASS was conducted using confirmatory factor analysis, composite reliability, and multi-group analysis. It was found that the bifactor model consisting of specific factors (depression, anxiety, and stress) and general factors (psychological distress) was the best factor structure of the Indonesian version of the DASS (GFI = .954, CFI = .956, RMSEA = .049). In addition, this version has satisfactory composite reliability (.806 – .917) and gender measurement is invariant. The findings indicate that the Indonesian version of the DASS was a valid and reliable measurement tool to measure and compare depression, anxiety, stress, and psychological distress between genders in the Indonesian sample.", "Citation Title": "Psychometric properties of the Indonesian version of the Depression Anxiety Stress Scale: Factor structure, reliability, gender, and age measurement invariance", "DOI": "10.21580/pjpp.v6i1.7815"}
{"Abstract": "Parenting of children with Autism Spectrum Disorder (ASD) and Attention Deficit Hyperactivity Disorder (ADHD) faces many challenges and often causes stress amongst parents. This study aims sto analyze the differences in parenting stress, perceptions of social support, self-compassion, and parenting practices in groups of mothers of ASD children and of ADHD children. The Parental Stress Scale, the Multidimensional Scale of Perceived Social Support, the Self-compassion Scale, and the Parent Construct were used to collect the study data. The survey was taken voluntarily online by 34 mothers of ASD children (52%) and 31 mothers of ADHD children (48%). MANOVA and regression analysis were performed to test the study hypothesis. The results show that there was no significant difference in parenting stress (F=0.04, p&gt;.05), social support (F=0.16 – 0.31, p&gt;.05), self-compassion (F=0.01 – 1.46, p&gt;.05), and parenting practices (F=0.04 – 2.29, p&gt;.05) between the two groups. Parenting stress had a significant negative effect on parenting practices in both groups studied (p&lt;.05). The study provides an overview of the parenting practices of parents of ASD and ADHD children in Indonesia.", "Citation Title": "Parenting stress, social support, self-compassion, and parenting practices among mothers of children with ASD and ADHD", "DOI": "10.21580/pjpp.v6i1.6681"}
{"Abstract": "A series of acts of terrorism involving women in various parts of the world, including in Indonesia, allegedly carried out by radical Muslim groups, has strengthened stereotypes and created prejudice against Muslim women who wear the veil. This study aims to explain the role of right-wing authoritarianism (RWA) and intergroup anxiety as antecedents of prejudice against veiled Muslim women. Using a cross-sectional survey design, the study sample (N= 403), domiciled in the city of Surabaya, Indonesia, was selected by accidental sampling. RWA, intergroup anxiety, and prejudice against veiled Muslim women were measured using a questionnaire, and the research hypotheses was analyzed by multiple linear regression. The results show that RWA and intergroup anxiety play a significant role in explaining prejudice against veiled Muslim women (R = .826; R 2  = .682; F = 428.68; p &lt; .01), with the relative contributions of RWA and intergroup anxiety being 34% and 66% respectively. The theoretical implication of the research is that RWA and intergroup anxiety act as antecedents of prejudice against veiled Muslim women.", "Citation Title": "Prejudice against veiled Muslim women: The role of  right-wing authoritarianism and intergroup anxiety", "DOI": "10.21580/pjpp.v6i1.7483"}
{"Abstract": "Married couples face various challenges in their married life, with divorce being one of the threats to their relationship. Spouse resilience is the process by which couples manage marital challenges through positive relationship behavior. This study examines the resilience of partners by including negative behavior in the relationships and examines the effects of interactions between partners. Three hundred couples living in Bali, Indonesia (length of marriage of between 1-10 years) participated by reporting positive and negative behaviors, and the outcomes of their relationship (marital satisfaction, emotional well-being, and general health status). The measurement instruments employed were the Couple Resilience Inventory, Satisfaction with Married Life Scale, and the 36-item Short-Form Health Survey. Model fit analysis showed that behavior in relationships did not predict the outcomes referred to above, and that there was no interaction effect between partners. However, positive behavior showed a higher probability of predicting marital satisfaction, especially for wives (β = .271; β = .403; p &lt; .001). The implications of these findings provide practical suggestions for future partner resilience research to apply a longitudinal approach that repeatedly measures the outcomes of resilience.", "Citation Title": "Couple resilience predicted marital satisfaction but not well-being and health for married couples in Bali, Indonesia", "DOI": "10.21580/pjpp.v6i1.6520"}
{"Abstract": "Protective and risk factors are important issues to consider to reduce the vulnerability of adolescents to drug abuse. This study aims to determine the vulnerability to drug abuse in terms of gender differences in high-risk areas, based on statistics/data from the National Anti Narcotics Agency of Malaysia, namely in Sabak Bernam, Dungun, Johor Bahru, and Kuala Kedah. A survey method was employed, with 213 adolescents (52.1% male, 47.9% female) who met the inclusion criteria completing the questionnaire. The questionnaire consisted of five aspects, namely demographic profile, interpersonal conflict, negative emotions, social support, and mental health. Data analysis was conducted using descriptive and inferential statistics. The results of the analysis show that there was no significant difference in aspects of interpersonal conflict (t=-0.556, p &gt; .05), negative emotions (t=0.131, p&gt;.05), or mental health by gender (t=-0.898, p &gt; .05). However, there was a significant difference in the aspect of social support (t=-2.046, p &lt;.05), with female subjects (37.13) showing a higher mean score than males (34.83). The findings of the study indicate that it is very important to understand the relevant factors so that drug abuse can be identified and prevented early on.", "Citation Title": "Exploring gender differences in the vulnerability towards drug abuse among adolescents in Malaysia", "DOI": "10.21580/pjpp.v6i1.6679"}
{"Abstract": "An increase in the prevalence of unhealthy lifestyles, including dietary problems, is being experienced by students, especially women. This study aims to examine the model of whether self-esteem, attitude towards the body, eating habits, and Body Mass Index (BMI) affects cognitive reactivity in female students. The non-probability convenience sampling technique was employed. A total of 140 female students in Semarang, Indonesia, aged 18-22 participated in this study. The measuring instruments used were the Rosenberg Self-Esteem Scale (RSES), the Dresden Body Image Questionnaire (DBIQ), and the Adult Eating Habit Questionnaire (AEHQ). Analysis was made using partial least squares structural equation modeling (PLS-SEM). The results show that self-esteem significantly and positively affected attitudes towards the body (R 2 =36.3%, p&lt;.01), and significantly and negatively affected BMI (R 2 =1.7%, p&lt;.05) and cognitive reactivity (R 2 =35.8%, p&lt;.01).  Furthermore, attitudes towards the body significantly mediated the relationship between self-esteem and eating habits (β = 0.166, p&lt;.01), and also significantly mediated the relationship between self-esteem and BMI (β = -0.157, p&lt;.01). Based on the results, the development of psychological interventions regarding self-esteem as health promotion in relation to lifestyle is highly recommended.", "Citation Title": "The effect of self-esteem, attitude towards the body, and eating habit on cognitive reactivity", "DOI": "10.21580/pjpp.v5i1.4561"}
{"Abstract": "Everybody aspires and deserves some personal well-being. This kind of well-being is subjective, and it is shaped by the way individuals perceive and feel the situations surrounding their lives. This study aimed to investigate the effect of gratitude and social support on fishermen's subjective well-being. This study's subjects were 299 fishermen living in the coastal area of Pelabuhan Ratu, who were chosen through an accidental sampling technique. In collecting data, subjective well-being was measured using Flourishing Scale and Scale of Positive and Negative Experience, Gratitude Scale, which was based on Gratitude Resentment and Appreciation Test, and Social Support Scale that was based on Multidimensional Scale of Perceived Social Support. Multiple regression analysis showed that the entire independent variables significantly influenced subjective well-being. Meanwhile, each dimension's regressive coefficient on the independent variables showed four sub-variables that significantly influenced the dependent variables: sense of abundance, simple appreciation, appreciation to others, and family support.", "Citation Title": "Gratitude and social support as predictors for fishermen's subjective well-being", "DOI": "10.21580/pjpp.v5i1.4859"}
{"Abstract": "Jackson’s Hybrid Model of Learning in Personality (HMLP) is designed to measure the effect of biological, socio-cognitive, and experiential processes of personality and learning mechanisms on developing rationality and directing functional or dysfunctional behaviors of employees. We use HMLP to determine if rational thinking predicts individual perception of safety climate. The results found that the proposed indirect paths of learning mechanisms significantly predict the individual perception of a safety climate through rationality. The goodness-of-fit demonstrated that the model provided a satisfactory fit: c 2  = 13.200, p = .067; RMS = .000; RMSEA = .063; GFI = .981; AGFI = .943; and CFI = .988. As a result, we identify the importance of rationality in predicting individual safety climate and once again confirm the usefulness of HMLP in predicting useful workplace outcomes. The HMLP offers valuable insights into the influence of rationality in predicting individual perception of safety climate, as well as the underlying process of developing rationality.", "Citation Title": "How rationality predicts individual perception of safety climate: An application of the hybrid model of learning in personality", "DOI": "10.21580/pjpp.v5i1.5274"}
{"Abstract": "Instagram addiction is a social phenomenon among teenagers that has been little studied. This study aims to empirically examine the effect of type D personality (social disinhibition and negative affectivity), self-esteem, and fear of missing out (FoMO) on Instagram addiction among adolescents. A total of 259 participants living in Greater Jakarta, Indonesia, with type D personalities with mild to severe addiction were identified through screening results (based on total score). Snowball sampling and regression were used to collect and process the data. The results of the analysis show that together, all the independent variables have an effect of 56.9% (p&lt;.01) on Instagram addiction. Partially, only negative affectivity (a type D personality factor) does not affect Instagram addiction (β=0.078, p&gt;.05), which means that such addiction is strongly influenced by a combination of external and internal factors. The study illustrates that individuals who have difficulty building social relationships in the real world due to negative self-esteem try to connect with others through social media such as Instagram.", "Citation Title": "Instagram addiction in teenagers: The role of type D personality, self-esteem, and fear of missing out", "DOI": "10.21580/pjpp.v5i1.4916"}
{"Abstract": "The trend of employees leaving companies is highest in the millennial generation, and is expected to continue to increase year on year. This study aims to ascertain how the meaningfulness of work affects the intention to leave through the role of work engagement as a mediator in the millennial generation sample studied. The research was conducted on 446 millennial generation employees (aged 20-37) working in various types of companies in Indonesia, using the convenience sampling method. The instruments used in the research were the Work as Meaning Inventory, Utrecht Work Engagement Scale-9, and the Turnover Intention Scale. Based on the mediation analysis, work engagement significantly acts as a mediator in the relationship between the meaningfulness of work and the millennial generation’s intention to leave their company (= -0.071, SE = 0.012, LLCI = -0.094, ULCI = -0.047). It is hoped that the findings from the study will provide information for organizations on promoting meaningful work and work engagement and thus increasing the desire of millennial generation employees to stay longer in their company or organization.", "Citation Title": "Searching for meaning: The mediating role of work engagement in the relationship between meaningful work and turnover intention of Millennials", "DOI": "10.21580/pjpp.v5i1.4305"}
{"Abstract": "Anxiety disorders are defined by the World Health Organization (WHO) as the sixth most common non-lethal disease that contributes to a decline in global health. In emerging adulthood, which is the developmental stage of individuals aged 18-25, anxiety is the most common disorder. This study aims to determine the relationship between materialism and anxiety mediated by self-esteem in emerging adulthood in Yogyakarta, Indonesia. Data were collected through the quota sampling technique and involved 332 emerging adults aged 18-25, consisting of 69 men and 263 women. Measurements were made using the Materialistic Value Scale of Richins and Dawson, the Rosenberg Self-Esteem Scale, and the Beck Anxiety Inventory. The scales were distributed through an online questionnaire. Hypothesis testing was conducted using mediation regression analysis with the causal step method. The results show that all the regression paths were significant, indicating that self-esteem partially mediated the relationship between materialism and anxiety (B = 0.055, p &lt; .01). The findings provide an overview of the dynamics of early adult individual anxiety related to materialism and self-esteem.", "Citation Title": "The mediating effect of self-esteem on emerging adults’ materialism and anxiety", "DOI": "10.21580/pjpp.v5i1.5484"}
{"Abstract": "Organizational Citizenship Behavior (OCB) refers to employee behavior that is voluntary and does not attract formal rewards from organizations, but which can increase their effectiveness and efficiency. This study aims to examine the mediating effect of psychological empowerment on the relationship between perceived workload and OCB. Data were collected using the snowball sampling method and an online survey of 201 employees aged 19-50 working in various private organizations in Indonesia, particularly in the Jakarta, Indonesia (female: 54.7%; male: 45.7%). The measuring instruments used were the workload subscale of the Job Demand-Resource scale, the Psychological Empowerment Questionnaire (PEQ), and the OCB subscale of the Task Performance Scale. Data were analyzed by the mediation technique using Hayes's Macro. The results show that perceived workload positively predicted psychological empowerment (B = 0.192, p &lt; .01) and that psychological empowerment positively predicted OCB (B = 0.2189, p &lt; .01). The results also show that psychological empowerment mediated the relationship between perceived workload and OCB (B= 0.021, SE = 0.0160, 95% CI [0.0143, 0.0759]). From the findings, it is expected that organizations will be able to manage the workload of their employees and create positive emotions in it.", "Citation Title": "Perceived workload and organizational citizenship behavior (OCB): The role of psychological empowerment", "DOI": "10.21580/pjpp.v5i2.3694"}
{"Abstract": "Significant concern about obedience in the face of unethical behavior in many corporate scandals is growing worldwide. However, the issue is underexplored because this type of research is faced by the challenge that the perpetrators are reluctant to harm their image by admitting their wrongdoings. The purpose of this study is to obtain a deeper understanding of the human aspects of obedience in the face of unethical behavior among employees in organizations. Using a qualitative cross-case approach, ten employees were interviewed, representing top, middle, and low-level employees in a broad range of private medium-to-large-sized enterprises. The analysis process involved reducing the raw data into meaningful themes, particularly why employees perform unethical behavior. The study's findings provide complex reasons for obedience in the face of unethical behavior, and it is shown to be the rule and habit of organizations. The respondents also explained why they justified their misbehavior. The employees' viewpoints on obedience in the face of unethical behavior will be useful for organizations to curb unlawful practices in the workplace, as these have detrimental effects on them.", "Citation Title": "Investigation into obedience in the face of unethical behavior", "DOI": "10.21580/pjpp.v5i2.7074"}
{"Abstract": "This study aimed to compare the impact of different types of flexible work arrangements (flextime and telecommuting) on ethical decision-making. Ethical decision-making is when individuals use their moral basis to determine what is right and wrong in a given situation. It involves an awareness of moral dilemmas and consideration of the consequences of decisions. Flexible work arrangements are offered to promote individuals’ ethical decision-making by balancing their needs at work and outside work, such as spending time with family. This research was conducted on 185 employees and used a quantitative approach that utilizes experimental methods with a post-test-only design. Employees’ ethical decision-making was measured using two vignettes. Data analysis was conducted using the independent sample t-test parametric statistical technique. The study results indicated a t = 4.21 and a significance level of .00 (p &lt; .05), which showed that this study's working hypothesis was acceptable. It concluded that there were differences in ethical decision-making between two types of flexible work arrangements: flextime and telecommuting groups.", "Citation Title": "The effect of flexible work arrangements on ethical  decision-making", "DOI": "10.21580/pjpp.v5i2.4279"}
{"Abstract": "The transition period from school to the world of work is a critical time that affects determining one's career. This study aims to examine the role of grit and parent-child communication in students’ career adaptability. Using a purposive sampling technique, the study involved 218 High School (SMA) students and 124 Vocational High School (SMK) students in Salatiga, Indonesia. The measurement instruments used in the research were the career adaptability scale, grit scale, and parent-child communication scale. The results show that the R-value was .595 and the adjusted R squared (R 2 ) value was .354. The significance value generated from the regression test was .000 (p&lt;.01). Based on the calculation results, it can be concluded that grit and communication between parents and children together play a significant role in career adaptability. The research implication is that students’ grit and effective parent-child communication should be developed to improve career adaptability.", "Citation Title": "The role of grit and parent-child communication in career adaptability", "DOI": "10.21580/pjpp.v5i2.5727"}
{"Abstract": "Contact between groups continues to be recognized as a variable that affects prejudice. The effectiveness of the impact of such contacts on prejudice is influenced by other variables, according to the characteristics of the group. This study aims to determine the effect of group identity mediation and religious funda­mentalism on the influence of intergroup contact on the prejudice of transnational Islamic groups against moderate Islamic ones. The research subjects were selected randomly from 365 members of Jama’ah Tabligh, a transnational Islamic group in Semarang, Indonesia. The research data collection used the scales of prejudice, intergroup contact, group identity, and religious fundamentalism, while the data analysis employed structural equation modeling (SEM). The results show that group identity and religious fundamentalism have a mediating effect on intergroup contact's impact on the prejudice of transnational Islamic groups against moderate ones. This research's theoretical implication is that the extent of the influence of intergroup contacts on prejudice is affected by group identity and religious funda­mentalism as mediating variables.", "Citation Title": "The mediating effect of group identity and religious fundamentalism on the association of intergroup contact with prejudice", "DOI": "10.21580/pjpp.v5i2.6486"}
{"Abstract": "Psychological well-being (PWB) is important for prisoners, considering that they lead different lives and become increasingly depressed by being labeled as criminals by society. This study aims to examine the effectiveness of group counseling using a Solution-Focused Brief Therapy (SFBT) approach to improve prisoners' PWB. A quasi-experimental design was employed, with repeated measurements (pre-test, post-test, and follow-up). The subjects were 14 Class II A prisoners in Pekalongan, Indonesia, prison, with seven inmates in the experimental group and seven in the control group. They were selected using the purposive sampling technique based on inclusion criteria and low PWB levels obtained from the psychological well-being scale. The study results indicate that group counseling using the SFBT approach is effective in increasing the PWB of prisoner’s pre-test vs. post-test (MD = -64.857, SE = 3.749, p&lt;.05), and post-test vs. follow-up (MD = -71.571, SE = 3.479, p &lt;.05). The study findings could be used as consideration, reference, and an alternative for counselors to use the SFBT approach in dealing with problems related to psychology, especially PWB.", "Citation Title": "Improving the psychological well-being of prisoners through group counseling with solution-focused brief therapy (SFBT) approach", "DOI": "10.21580/pjpp.v5i2.6036"}
{"Abstract": "Financial difficulties commonly occur in college students' lives. Problems might be caused by a lack of understanding about managing money, such as falling into the temptation of buying unnecessary discounted goods or choice justification. The research aims to understand how mental budgeting influences purchasing discounted items and choice justification. In the study, two experiments were undertaken to explain the reaction of discount, and two others to describe choice justification (N=169 in Indonesia, N=168 in China). Mann-Whitney U and ANOVA tests were used to analyze the experiments. Mental budgeting scales were also employed in experiments 3 and 4. The results show that when individuals receive a discounted offer for luxury goods, they will fall into the temptation of buying them. This takes place because they do not want to lose the opportunity to obtain such goods at a cheap price. In addition, when individuals receive offers related to physiological needs (i.e., food), they will practice choice justification. This means that all people need to understand the concept of mental budgeting and make realistic budgets.", "Citation Title": "Mental budgeting and the malleability of decision-making", "DOI": "10.21580/pjpp.v5i2.5759"}
{"Abstract": "This research is based on the tragedy of a road traffic accident that led to a student's death. Her classmates felt lost and experienced symptoms of Post-traumatic Stress Disorder (PTSD). The purpose of the study is to examine the effectiveness of repentance and  istighfar  therapy to prevent PTSD. The research was based on a quasi-experimental design that consisted of six sessions in three meetings and homework for four weeks. The study participants were 14 students who experienced PTSD symptoms. They completed a scale before the intervention (pre-test), after completion of the intervention (post-test), and three weeks after the post-test. The paired sample test analysis results show that there were significant differences in the trauma scores pre-therapy and post-therapy. The effect size estimation results show that the effect of repentance and  istighfar  therapy was in the large effect size category; that is, 80.9% of the trauma variations could be explained (caused) by repentance therapy and  istighfar . The research implies that such therapy can be predicted to be effective in reducing psychological disorders, as long as they are willing to be seriously involved in each stage of the therapy process that has been determined.", "Citation Title": "Effect of Islamic-based repentance therapy on the prevention of Post-traumatic Stress Disorder (PTSD)", "DOI": "10.21580/pjpp.v5i2.6505"}
{"Abstract": "The issue of married women who work as academic lecturers is important to be studied. They are demanded to preserve their independence and increase intellectuality which then may decrease when they have children. This study aimed to examine whether positive spillover can reduce work-family or family-work conflict so as to improve psychological well-being. The subjects, who were screened with a random sampling technique, were 429 female lecturers working in universities in Riau.  Data were analyzed using descriptive analysis and multiple regression. The result showed that respondents have low psychological well-being and better family-work positive spillover. Multiple regression analysis showed that family-work positive spillover and family-work conflict simultaneously influenced psychological well-being. Therefore, it can be concluded that female lecturers prioritize completing home tasks over others, which reduces their psychological well-being at the workplace.", "Citation Title": "The effects of positive spillover and work-family conflict on female academics’ psychological well-being", "DOI": "10.21580/pjpp.v4i2.3522"}
{"Abstract": "Mathematics until today is still considered a difficult subject so that it needs to think about appropriate strategies to encourage students to be able to regulate themselves in learning this subject. This study aimed to test empirically the role of classroom management and mastery goal orientation towards self-regulated learning. The participants of the study were 177 students of state high schools in Sleman, who were selected using a purposive sampling technique. The scales used were self-regulation of mathematics learning scale, classroom management scale, and mastery goal orientation scale. The data analysis using two-predictor regression analysis showed that classroom management and mastery goal simultaneously played a significant role by 68.7% (R2=0.687, F (2.177) =191.243, p&lt;0.01). Classroom management predicted self-regulation (β= -0.130, p &lt; 0.01), and so did mastery goal (β= 0.878, p &lt; 0.01). Based on the results of this study, it could be concluded that self-regulation in learning Mathematics can be determined through classroom manage­ment and mastery goals concurrently.", "Citation Title": "The role of classroom management and mastery goal orientation towards student’s self-regulation in learning Mathematics", "DOI": "10.21580/pjpp.v4i2.3576"}
{"Abstract": "Nurses have a heavy workload, which has become heavier during the COVID-19 pandemic, putting them at risk of psychological stress and affecting their psychological well-being, which impacts their mental health, work productivity, and self-development. In addition, their worship activities also decrease. However, there has been little research on Islamic-based interventions to improve the psychological well-being of nurses. This study seeks to determine the effectiveness of Islamic-based positive psychology training on improving such well-being by comparing the pre-test and post-test results of the control and experimental groups employed. The Ryff Psychological Well-being Scale and training were given to 38 respondents using consecutive sampling. The data were analyzed using SPSS 25.0, observation, independent assignments, and open questionnaires. The Mann-Whitney test results (Z = -2.416; p ˂ .05) and those of Wilcoxon (Z-experiment = -2.774; p ˂ .05 and Z-control = -0.081; p &gt; .05) show that Islamic-based positive psychology training is effective in improving the psychological well-being of nurses. This research contributes to providing alternative interventions that can be used to foster positive activities and emotions that can improve such well-being.", "Citation Title": "Improving the psychological well-being of nurses through Islamic positive psychology training", "DOI": "10.21580/pjpp.v7i1.10792"}
{"Abstract": "Parental divorce affects the ability of individuals to flourish. This study aims to determine the relationship between forgiveness and gratitude and the flourishing of emerging adults whose parents have divorced. Voluntary convenience sampling was used to identify respondents (N = 429 emerging adults whose parents had been divorced for at least two years). Data were collected using the Emotional Forgiveness Scale, the Gratitude Questionnaire-Six Item Form, and the PERMA Profiler. Data analysis was performed using multiple regression analysis. The results show that forgiveness and gratitude were significantly associated with flourishing in emerging adults whose parents divorced (R 2  = .382, F = 131.634, p &lt; .05). The contribution of gratitude (β = 1.299) to flourishing was greater than that of forgiveness (β = .722). Forgiveness and gratitude can predict flourishing in emerging adults whose parents are divorced, in this case, the role of gratitude is greater than forgiveness. Interventions that combine the basis of forgiveness and gratitude can be used to optimize the flourishing of such emerging adults whose parents are divorced.", "Citation Title": "Forgiveness, gratitude, and the flourishing of emerging adults with divorced parents", "DOI": "10.21580/pjpp.v7i1.10606"}
{"Abstract": "College students are in a period of instability, which may be stressful and put them at risk of developing the intention to self-harm. This study examines the effect of self-criticism as a mediator in the association between emotion dysregulation and the intention to self-harm. Quantitative research was conducted on 354 students aged 18-23 years, using the disproportionate cluster random sampling technique. The instruments used were an intention to self-harm scale, self-criticism scale, and emotion dysregulation scale. The results from the mediation analysis conducted using the PROCESS program of Hayes shows that self-criticism significantly mediates the association between emotion dysregulation and students' intention to self-harm (ab = .39, BootSE = .05, 95% BootCI [.29 to .48]). Nevertheless, the results also suggest that even after accounting for the mediating effect of self-criticism, emotion dysregulation still positively impacts students' intention to self-harm (c' = .14, p = .017). The implications of the findings provide insights for college students and all the parties involved with them regarding the mechanisms behind the intention to self-harm.", "Citation Title": "The mediating effect of self-criticism on college students' emotion dysregulation and intention to self-harm", "DOI": "10.21580/pjpp.v7i1.10813"}
{"Abstract": "The various challenges and difficulties faced by college and university freshmen (new students) during the COVID-19 pandemic can affect their well-being. This well-being condition is influenced by gratitude and religiosity, as well as the role of religiosity in moderating these relations, are the main objectives of this study. The research was conducted on new students in the 2020/2021 and 2021/2022 academic years (N = 2048). Data collection was made through surveys by distributing online questionnaires, including the Gratitude Questionnaire-6, the Short Muslim Belief and Practice Scale, and the WEMWBS Scale. Data analysis was performed using multiple regression and a moderation test. The results show an influence of gratitude (β = .928, p &lt; .01) and religiosity (β = .371 p &lt; .01) on well-being. Religiosity is demonstrated to moderate the relationship between gratitude and well-being (F = 251.656, p &lt; .01). The study has empirical implications in the form of the theory that career achievement and well-being orientation for new students will face various problems, but can be helped by introducing self-protective factors in the form of well-being, religiosity, and gratitude.", "Citation Title": "The relationship between gratitude and well-being: The moderating effect of religiosity on university freshmen during the COVID-19 pandemic", "DOI": "10.21580/pjpp.v7i1.11055"}
{"Abstract": "Parenting style has been highlighted as one of the causes of depressive symptoms and also influences adolescent self-esteem. Although many studies have investigated the effect of self-esteem on depression, few have considered its role as a mediator variable. Therefore, this study aims to analyze the direct effect of parenting style on adolescent depression and its indirect effect on self-esteem. An online survey was completed voluntarily by 555 respondents from four senior high schools in Bekasi, Indonesia. The Patient Health Questionnaire, Parental Authority Questionnaire, Rosenberg Self-esteem Scale, and Path-SPSS analysis were employed to prove the hypothesis. The results show a significant direct effect of parenting [authoritative (β = -.257, p &lt; .01), authoritarian (β = .181, p &lt; .01) and permissive (β = .109, p &lt; .01)] on depression. In addition, there is an indirect effect of authoritative (β = -.182, p &lt; .01) and authoritarian (β = .055, p &lt; .01) parenting styles on depression as mediated by self-esteem. The study indicates the importance of positive parenting and the building of adolescents' self-esteem to avoid the risk of depression.", "Citation Title": "Parenting style and depression among students: The mediating role of self-esteem", "DOI": "10.21580/pjpp.v7i1.9885"}
{"Abstract": "Students in Indonesian boarding schools ( pondok pesantren ) have longer study hours than those in non-boarding schools. They also interact with the same friends all day. This situation makes them vulnerable to boredom and depression, and they also run the risk of being bullied. Therefore, student well-being in boarding schools needs to be studied further, with peer attachment and academic self-efficacy as predictors. This study aims to examine the effect of peer attachment and academic self-efficacy on the well-being of students attending boarding school. The study uses a quantitative approach with the linear regression method. It involves 284 students at  Madrasah Tsanawiyah  (Islamic Junior High School), aged between 13-15 years old, selected using the stratified random sampling method. The data collection instruments employed were the Peer Attachment Scale, Academic Self-efficacy Scale, and School Well-being Scale. The result shows that peer attachment and academic self-efficacy significantly affect school well-being (p &lt; .01, F = 156.181, effective contribution of predictors = 52.3%). It indicates that peer attachment and academic self-efficacy simultaneously significantly influence well-being among students in boarding schools. Students should improve their peer attachment and increase their academic self-efficacy to live well in boarding schools.", "Citation Title": "Well-being among boarding school students:  Academic self-efficacy and peer attachment as predictors", "DOI": "10.21580/pjpp.v7i1.10374"}
{"Abstract": "Friendship quality plays an essential role for adolescents in achieving optimal life satisfaction. However, previous studies have failed to explain friendship quality and life satisfaction fully. This study examines the role of basic psychological need satisfaction in the relationship between friendship quality and life satisfaction. A total of 450 respondents consisting of three groups of 150 early, middle, and late adolescents participated in this study. Data were collected using quota and convenience sampling methods. Friendship quality, basic psychological need satisfaction, and life satisfaction were measured using the McGill Friendship Questionnaire–Friend's Functions, Sub-scale Satisfaction of the Basic Psychological Need Satisfaction and Frustration Scale, and the Indonesian version of the Satisfaction with Life Scale. The hypothesis was tested using regression analysis and SOBEL macro for SPSS. The results show that basic psychological need satisfaction acts as a full mediator between friendship quality and life satisfaction (indirect effect = .330, z = 8.383, p &lt; .05). In addition, the satisfaction of the need for autonomy, competence, and relatedness can also be a full mediator between friendship quality and life satisfaction. This finding can be an alternative in explaining this relationship between friendship quality and life satisfaction. In addition, the findings can also be used to develop mental health programs for adolescents.", "Citation Title": "The role of basic psychological need satisfaction as a mediator between friendship quality and life satisfaction", "DOI": "10.21580/pjpp.v7i1.10394"}
{"Abstract": "Health workers are professionals with high exposure to various types of stress; therefore, they need resilience to survive in their profession. This research aims to test the effect of social support and calling on resilience in health workers.  It is a quantitative-correlational study conducted cross-sectionally. The instruments used were the Connor-Davidson Resilience Scale, Multidimensional Support Scale, and Calling Scale. Snowball sampling was used to identify participants, consisting of 113 health workers in East Nusa Tenggara province, Indonesia. The data were analyzed with multiple linear regression techniques. Significant effects of social support and calling were found on resilience (p &lt; .01, F = 34.224), with calling shown to have more significant impact (p &lt; .01, F = 60.685) and 35.3% effective contribution. Amongst the types of social support, coworkers make the most significant contribution of 11.8% (p &lt; .01, F = 14.816), followed by family members at 9.6% (p &lt; .01, F = 11.752). On the other hand, social support from supervisors does not affect resilience (p &gt; .05, F = 0.904). Health workers should seek the social support they need proactively, and prospective health workers should consider their calling when choosing a career.", "Citation Title": "Resilience in health workers: The role of social support  and calling", "DOI": "10.21580/pjpp.v7i1.9287"}
{"Abstract": "Psychological resources are crucial in enhancing individual potential, yet few studies have focused on positive psychological variables among job seekers. Therefore, the objective of this study is to examine the influence of psychological capital on flourishing, with grit as a mediator. A cross-sectional survey method was employed, with data collected using questionnaires involving 226 participants. Three instruments were included in the questionnaire: the Psychological Capital Questionnaire (PCQ), the Flourishing Scale, and the Short Grit Scale. The data were analyzed using bootstrapping mediation analysis via PROCESS software. The results show that all the psychological capital dimensions (hope, efficacy, resilience, and optimism) significantly influenced grit, with β ranging from .21 to .57 (p &lt;.000), and also significantly influenced flourishing, with β ranging from .23 to .40 (p &lt;.000). Grit also significantly mediated the psychological capital dimensions and flourishing. These findings indicate that psychological capital, grit and flourishing are important in developing individuals’ potential. It is hoped that they will be useful in designing employability training which incorporates positive psychology resources as intervention modules to assist graduates seeking job opportunities.", "Citation Title": "The role of psychological capital in flourishing among  job seekers: Grit as a mediator", "DOI": "10.21580/pjpp.v8i1.14939"}
{"Abstract": "Hospitalization affects the emotional, psychological, and social well-being of schizophrenic patients. The process can produce experiences of both flourishing and languishing. This study aims to identify and describe such experiences of schizophrenic patients during hospitalization. A phenomenological qualitative method was employed with six schizophrenic patients hospitalized at Ernaldi Bahar Hospital in Palembang, Indonesia. Research data were collected using semi-structured interviews and documentation methods. These were analyzed using thematic analysis. The findings demonstrate the developing experiences of schizophrenic patients during hospitalization; there are three themes: 1) experiencing increased contact with and awareness of reality, 2) finding meaning and purpose in life, and 3) finding positive relationships among patients. Languishing experiences were also classified into three themes: 1) feeling bored and confined, 2) experiencing unpleasant events on arrival, and 3) experiencing social isolation. In particular, clinical struggle, functional recovery, and cultural struggle are predictors of the flourishing and languishing experiences of hospitalized schizophrenic patients. The findings contribute to developing the concept of languishing and flourishing among such patients through evidence-based empirical data regarding the efforts to foster and maintain their subjective well-being during hospitalization.", "Citation Title": "Languishing and flourishing experiences in schizophrenic patients during hospitalization", "DOI": "10.21580/pjpp.v8i1.15536"}
{"Abstract": "College education is expected to equip students with various types of knowledge. In reality, however, the learning process is not always easy. Problems can occur and affect students' quality of life. This study aims to examine the effect of state anxiety and academic stress on the quality of life through the mediation of student self-control. A quantitative method was used involving a sample of 400 students from 24 provinces in Indonesia. The measuring instruments employed were the World Health Organization Quality of Life (WHOQOL), The State Anxiety Scale, the Academic Stress Scale, and the Brief Self-Control Scale. Path analysis was conducted using R software. It was found that self-control partially mediates the effect of state anxiety on the quality of life. State anxiety has a direct effect, with a standardized coefficient of -.351 (p &lt; .01), and an indirect one, with a standardized coefficient of -.150 (p &lt; .01) on reducing the quality of life through the mediation of self-control. Academic stress has no indirect effect on the quality of life through the mediation of self-control with a standardized coefficient of -.000 (p = .990, p &gt; .05). However, it was found to play a direct role in reducing the quality of life, with a standardized coefficient of -.207 (p &lt; .01). The findings indicate the multi-dynamic impacts of state anxiety and academic stress toward the quality of life of students. Therefore, the development of anxiety and stress-management skills in students need to be addressed in the higher education management system in order to maintain the quality of life of students.", "Citation Title": "Quality of life of college students: The effects of state anxiety and academic stress with self-control as a mediator", "DOI": "10.21580/pjpp.v8i1.14733"}
{"Abstract": "Caregivers of children with special needs experience a high workload, which causes stress and low quality of life. A compassionate love attitude amongst caregivers is needed to improve the quality of parenting. This study aims to develop a compassionate love parenting training program to reduce stress among children with special needs caregivers. The method employed was Pre-experimental Design, with One-group Pre-test-Post-test. The research participants were 40 care­givers identified using the purposive sampling technique. In the pre-test, the stress level of the caregivers was measured using the Parental Stress Scale with 24 items (α = .828). The data were analyzed using the Wilcoxon test to observe the differences between the pre-test and post-test of two dependent samples. The results show that the stress score decreased significantly, with Z = -2.023 and with a significance level of .043 &lt; .05. It is demonstrated that regular training in compassionate love parenting reduced the stress felt by caregivers of children with special needs. The implementation of compassionate love parenting training in special needs therapeutic centers is important, as it is one of the intervention methods that has been proven to reduce the level of stress to optimize the growth of the child.", "Citation Title": "Compassionate love parenting training to reduce stress in caregivers of children with special needs: An experimental study", "DOI": "10.21580/pjpp.v8i1.14931"}
{"Abstract": "Adaptation theory explains that mothers’ subjective well-being (SWB) is determined by their abilities to adapt to challenging life events using coping mechanisms. The literature highlights three latent coping mechanism factors: emotional regulation, mindfulness, and gratitude. This study aims to build a model of mothers’ SWB based on these factors. The sample comprised 302 young mothers (20-25 years old) selected using convenience sampling. Data were solicited from Likert scales that measured emotion regulation, mindfulness, gratitude, and SWB and analyzed using structural equation modeling. The results show that the SWB model had adequate goodness of fit, with a chi-square of 153.553 (p &lt; .05), GFI of .934, AGFI of .899, CFI of .929, TLI of .906, and RMSEA of .076. The model shows that emotion regulation and mindfulness, mediated by gratitude, influenced SWB, with gratitude as a strong predictor of SWB. As an implication in counseling, gratitude interventions should be applied in practice.", "Citation Title": "Insights on mother’s subjective well-being: The influence of emotion regulation, mindfulness, and gratitude", "DOI": "10.21580/pjpp.v8i1.13655"}
{"Abstract": "The characteristic of fairness is a virtuous one that adolescents should possess as capital to interact with their social environment. However, no validity of evidence supports the score interpretation of a fairness character scale. The purpose of this study is to obtain evidence for the validity of the scale for adolescents. The research data were collected from 532 adolescents in Indonesia, ranging in age between 14 and 18 years. Scale development covers all stages of the process by assessing the required validity and reliability of evidence. Based on the ratings obtained from the scale, exploratory and confirmatory factor analysis were performed to identify the internal structure of the validity evidence. The results of the factor analysis found that the scale consisted of four factors, namely \"exploitation\", \"appreciation\", \"social role\", and \"open behaviour\". Cronbach alpha's internal consistency value was calculated to be .84. After completing all stages of the scale development, 20 items related to the characteristic of fairness were obtained. Therefore, the scale can be used by positive psychology developers to measure and identify the development of fairness in adolescents in Indonesia. The scale will complement the previously developed character strength measurement tools.", "Citation Title": "Evidence of the validity of the fairness character scale for adolescence: A Confirmatory Factor Analysis (CFA) technique", "DOI": "10.21580/pjpp.v8i1.13589"}
{"Abstract": "Quarter-life crisis is a psychosocial crisis in which individuals are vulnerable to experiencing psychological distress. One contributor to such distress is uncertainty intolerance, while personal growth initiative is a factor that can reduce it. This study examines Personal Growth Initiative (PGI) in determining the effect of uncertainty intolerance on psychological distress in individuals experiencing a quarter-life crisis. A total of 309 participants were selected through a screening process using the Quarter-life Crisis Questionnaire. The participants completed the Intolerance of Uncertainty Scale, General Health Questionnaire-12, and Personal Growth Initiative Scale. Moderation regression analysis was performed using the Hayes PROCESS Macro. The results indicate that personal growth initiative buffers the effect of uncertainty intolerance on psychological distress in individuals experiencing a quarter-life crisis (B = -0.193, p = .003, R 2  = .117), but with differences shown based on age and gender categories. Based on the findings, it is necessary to build personal growth initiative skills, which will assist individuals in achieving and maximizing their potential and adapting well when faced with conditions of uncertainty.", "Citation Title": "Quarter-life crisis: Personal growth initiative as a moderator of uncertainty intolerance in psychological distress", "DOI": "10.21580/pjpp.v8i1.13527"}
{"Abstract": "Human flourishing entails a state of complete, intrinsic self-fulfillment; however, the concept also embraces interpersonal interaction through social connection. This research aims to explore the concept and dynamics of flourishing Muslim families. The data collection involved 45 to 120 minutes of in-depth interviews with five participant families. A qualitative approach was taken, with Interpretative Phenomenological Analysis (IPA) and MAXQDA 2020 techniques used to organize the data. We utilized the Ephocé and member-checking and adopted workflow protocol management tools (i.e., MAXQDA 2020) to ensure data credibility. Four super­ordinate themes emerged, namely compassionate love in collaboration; the adaptation process; relatedness to the larger circle beyond nuclear family members; and the role of religious and local wisdom teachings. All the themes were related to establishing the nature of a flourishing family. It is concluded that the meaning of “flourishing family” for the Indonesian Muslim Families participants emphasized shared relational well-being, which is more complex than the simple “human flourishing” concept. The findings contribute to developing the concept of a flourishing family through evidence based on empirical data regarding efforts to maintain positive potential in the family.", "Citation Title": "The dynamics of flourishing Indonesian Muslim families:  An Interpretative Phenomenological Analysis", "DOI": "10.21580/pjpp.v8i1.14382"}
{"Abstract": "Amidst the social-cultural predominance of male ulama in the religious context, female ulama play important roles and yet are often trapped in life-role complexity and gender bias, as they have a responsibility in both the domestic and public domains. This study aims to explore the meaning of the experience of gratitude among female ulama based on the perspective of positive psychology, with reference to the PERMA (Positive emotion, Engagement, Relationship, Meaning, and Accomplishment) model, with further interpretation of gratitude ( shukr ) from Sufi psychology. Using a qualitative (phenomenological) approach, we held online in-depth interviews with five female ulama participants from across Indonesia and Germany. The research demonstrates the interconnection between themes related to gratitude according to PERMA-Model and the embodiment of gratitude ( shukr ) in Sufi psychology. These findings provide evidence to support the practical implication of the integrative intervention of positive and Sufi psychology for clinical purposes or to promote flourishing and well-being among women.", "Citation Title": "The experiences of gratitude in female ulama:  An interpretation from Sufi psychology and PERMA-Model perspective", "DOI": "10.21580/pjpp.v7i2.13176"}
{"Abstract": "Children with Autism Spectrum Disorder (ASD) face obstacles in their cognitive development. This study aims to determine the effectiveness of the drum rhythm therapy model in stimulating cognitive abilities (attention, concentration, and short-term memory) in children with ASD. The experiment method was used with a one-group pretest-posttest design. Attention and concentration levels were measured both before and after therapy through a series of observations. A total of 14 children with ASD aged 4–12 participated in the study. All the participants were new students at Gilang Ramadhan Studio Band (GRSB), Surakarta, Indonesia. The drum rhythm therapy was employed with the participants for three months. Data analysis was conducted using Wilcoxon test analysis in SPSS Version 23. Results: The 14 participants showed an increase in attention, concentration and short-term memory scores following the therapy (Z = -2.533 b , p = .011, p &lt; .05). The results of the study could support the use of the alternative therapy with ASD children to increase their attention, concentration and short-term memory.", "Citation Title": "Drum rhythm therapy: An intervention to stimulate the cognitive abilities of children with Autism Spectrum Disorder (ASD)", "DOI": "10.21580/pjpp.v7i2.11837"}
{"Abstract": "Adolescence is a phase in life that is prone to depression. Depression in adolescents can be influenced by their family context, which can involve high parental expressed emotions and low emotion regulation among adolescents. This study aims to reveal the relationship between parental expressed emotion and adolescents’ depression, as mediated by emotional regulation in adolescents. The measuring instruments used are depression scales, the scale of adolescent emotional regulation and the scale of perceived parental expressed emotion. The participants were 212 adolescents who were identified using the purposive sampling technique. Analysis of the research data was made using simple mediation models with PROCESS. The results show a relationship between maternal expressed emotion and depression in adolescents, fully mediated by adolescent emotional regulation (BootLLCI = .030, BootULCI = .083, B = .055). There is also a relationship between fathers’ expressed emotion and depression in adolescents, partially mediated by adolescent emotional regulation (BootLLCI = .027, BootULCI = .073, B = .048). The results of the study could provide an alternative explanation of the dynamics of the relationships between fathers, mothers and adolescents. In addition, the findings emphasize the importance of adolescent emotion regulation.", "Citation Title": "Parental expressed emotions and depression among adolescents: The mediating role of emotion regulation", "DOI": "10.21580/pjpp.v7i2.12556"}
{"Abstract": "Many college students with mental health problems do not seek help. One of the predisposing factors that influences mental health help-seeking is personality traits. This study aims to explore the role of such traits in the mental health help-seeking intention of college students. It is a cross-sectional study using the correlational method. An online survey employing convenience sampling technique was completed by 480 participants. The survey covered demo­graphic data, the Big Five Inventory, and a mental health help-seeking intention questionnaire. The data were analyzed using descriptive statistics, Pearson’s correlation coefficient, and multivariate regression analysis. Conscientiousness ( b  = .170,  p- value = .000) was significantly associated with a higher intention to seek mental health help. Higher neuroticism also predicted higher mental health help-seeking intentions ( b  = .165,  p- value = .001). On the other hand, openness, extra­version, and agreeableness did not predict such intentions. The results suggest that personal disposition could affect help-seeking intentions and that certain personality traits had more impact on these. It is hoped that the results will contribute to providing better mental health support for students and promote help-seeking.", "Citation Title": "Mental health help-seeking intentions: The role of personality traits in a sample of college students", "DOI": "10.21580/pjpp.v7i2.11784"}
{"Abstract": "Racial trauma among Asians, including Indonesians, has increased dramatically in the United States. While many studies have been written about the significance of recurring race-related traumatic incidents, the broader meaning of the unexpected and dark side of racial trauma experiences among Indonesians who reside in the United States is under-reported. This study aims to explore the meaning of experience dealing with racial trauma among Indonesians living in the United States using a qualitative phenomenological approach. We conducted in-depth interviews via the Zoom platform with a nationally representative purposive sample of 16 adults aged 26 and older. In analyzing this phenomenological study, all stages of phenomenological reduction were used. The findings demonstrate that racial trauma among Indonesian Americans can be categorized into three themes: 1) feeling sad and angry, 2) being exhausted, and 3) suffering physically. Therefore, the myth that Asian Americans are immune to racism and its effects is not necessarily true. This study also offers implications for future research on racial understanding and discussion.", "Citation Title": "Disproving the myth of racial harassment and trauma among Indonesian Americans", "DOI": "10.21580/pjpp.v7i2.12444"}
{"Abstract": "Individual psychological health can be seen from the health of the skin. Some skin diseases such as psoriasis and atopic dermatitis can be exacerbated by psychological problems. Based on this, a collaboration between specialist doctors and psychologists is needed to screen for psychological disorders in sufferers. One psychological screening instrument is the Depression Anxiety Stress Scale (DASS)-21; this study aims to test its validity and reliability. Non-probability convenience sampling was employed, and 292 participants aged 18-54 were willing to take part in the study. An internal structure validity test was conducted using confirmatory factor analysis, while concurrent validity was assessed by correlating DASS-21 with PHQ-9, GAD-7 and PSS scores. The reliability test was analyzed using composite reliability. The results of the CFA analysis showed that the data matched Lovibond's theory and that all DASS-21 items were valid (RMSEA =.076, CFI=.961, TLI = .955, SRMR = .065). The results of the concurrent analysis showed that the three scales had a positive correlation with the dimensions of DASS-21, while the reliability results showed a satisfactory value (.850 – .923). The results of the study indicate that DASS-21 is a valid and reliable instrument and can be used to measure depression, anxiety and stress in individuals with psoriasis and atopic dermatitis.", "Citation Title": "Testing the validity and reliability of the Depression Anxiety Stress Scale (DASS)-21 instrument for individuals with psychodermatology", "DOI": "10.21580/pjpp.v7i2.11802"}
{"Abstract": "The ideal body image displayed in social media often makes women vulnerable to body image issues, one of which is body dysmorphic disorder (BDD). This study aims to examine the role of social media pressure in predicting the tendency towards such a disorder in emerging adult women, with each of the three dimensions of perfectionism as a mediator. The participants were 385 women aged 18-25 years who used social media and were selected using the convenience sampling technique. Data were collected using the Body Dysmorphic Disorder Screening Scale, Social Media Pressure Scale, Almost Perfect Scale-Revised (APS-R), and some open-ended questions distributed online through various social media. The BDD tendency model tested using structural equation modeling has a good fit with the data (χ2/df = .019, RMSEA = .001, CFI = 1.00) and shows that the role of social media pressure in women's BDD tendency was fully mediated through the discrepancy dimension of perfectionism. The findings indicate that a program is needed to develop media literacy and promote positive body images for women who use social media to prevent body image issues.", "Citation Title": "Social media pressure and the body dysmorphic disorder tendency in women: The mediating role of perfectionism", "DOI": "10.21580/pjpp.v7i2.10637"}
{"Abstract": "One way of making scholarships sustainable is to continue the “chain of kindness.” However, relatively few studies have examined the psychological predictors involved in making a scholarship recipient feel that “pay it forward” is under their control. This study aimed to determine the predictions of four types of narcissism on Perceived Behavioral Control (PBC) in continuing scholarship. The instruments used comprised psychological scales measuring PBC, which were constructed by the authors, and some types of narcissism, i.e. the Communal Narcissism Inventory (CNI), Brief-Pathological Narcissism Inventory (B-PNI), and the Narcissistic Personality Inventory-16 (NPI). Data were obtained by convenience sampling from 212 Indonesian scholarship recipients and analyzed with multiple linear regression (predictive correlational design). The results showed that the regression model had statistical significance ( F (4, 211)= 15.452,  p  = .000,  R 2   = 23%). A notable result was that communal narcissism predicted PBC in a positive direction. Narcissism often has negative connotations; however, the results contribute by showing that there is also a “bright side” of narcissism.", "Citation Title": "Pay it forward: Can perceived behavioral control to pass on scholarship aid be predicted by various narcissism?", "DOI": "10.21580/pjpp.v7i2.11768"}
